apply_case_test/constant/board/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/board/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    board_to_SOC
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1430;
        startFace       41022;
        sampleMode      nearestPatchFace;
        sampleRegion    SOC;
        samplePatch     SOC_to_board;
    }
    board_to_case
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          208;
        startFace       42452;
        sampleMode      nearestPatchFace;
        sampleRegion    case;
        samplePatch     case_to_board;
    }
    board_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          14990;
        startFace       42660;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_board;
    }
)

// ************************************************************************* //
