apply_case_test/constant/bottomcase/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/bottomcase/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    bottomcase_to_air
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          45586;
        startFace       154578;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_bottomcase;
    }
    bottomcase_to_thermalpad
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          586;
        startFace       200164;
        sampleMode      nearestPatchFace;
        sampleRegion    thermalpad;
        samplePatch     thermalpad_to_bottomcase;
    }
)

// ************************************************************************* //
