apply_case_test/Allrun
#!/bin/sh
# Allrun — generated by allrun_writer.py
# Regions: fluids=['air', 'air_normal']  solids=['SOC', 'board', 'bottomcase', 'case', 'thermalpad']
cd "${0%/*}" || exit 1
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

# ==========================================================================
# STEP 1 — Convert .msh to OpenFOAM format
# ==========================================================================
##runApplication gmshToFoam asm_no_screw_with_air.msh
#
## ==========================================================================
## STEP 2 — Scale from mm to m  (adjust -scale if your model uses different units)
## ==========================================================================
#runApplication transformPoints -scale "(0.001 0.001 0.001)"
#
## ==========================================================================
## STEP 3 — Check mesh quality before splitting
## ==========================================================================
#runApplication checkMesh
#if grep -q "FAILED" log.checkMesh; then
#    echo "ERROR: checkMesh FAILED. Fix mesh quality before continuing."
#    exit 1
#fi
#
## ==========================================================================
## STEP 4 — Split into per-region polyMesh
## ==========================================================================
#runApplication splitMeshRegions -cellZones -overwrite
#
## ==========================================================================
## STEP 5 — Deploy physics templates + material properties
## (apply_template.py is in the same directory as Allrun)
## ==========================================================================
#TEMPLATE_DIR="/home/oches/OF/gmsh_extension/upload/template_new"
#
#python3 "/home/oches/OF/gmsh_extension/upload/template_applyer_v2/main.py" deploy \
#    --template "$TEMPLATE_DIR" \
#    --case     "$(pwd)" \
#    --msh      "asm_no_screw_with_air.msh" \
#    --scale    "0.001"
#
#if [ $? -ne 0 ]; then
#    echo "ERROR: apply_template failed."
#    exit 1
#fi

# ==========================================================================
# STEP 6 — changeDictionary for each region
# ==========================================================================
    runApplication -s "air" changeDictionary -region "air"
    runApplication -s "SOC" changeDictionary -region "SOC"
    runApplication -s "board" changeDictionary -region "board"
    runApplication -s "bottomcase" changeDictionary -region "bottomcase"
    runApplication -s "case" changeDictionary -region "case"
    runApplication -s "thermalpad" changeDictionary -region "thermalpad"


# --- Run solver ---
runApplication chtMultiRegionSimpleFoam


echo ""
echo "✅  Simulation complete."
echo "    Post-process with: paraFoam -touchAll"
